# FloorHeightabovelevelParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FloorHeightabovelevelParam Property
ParameterTypeId Class See Also
---
"Height Offset From Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FloorHeightabovelevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorHeightabovelevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FloorHeightabovelevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace